["Adorable girls 😍", "We are all humans too ❤️", "❤️❤️😍", "I buy old MAL🇲🇾(coin$note)10Kmyr per☝\nOld SIN🇸🇬(coin$note)10Ksgd per☝\nOld BRU🇧🇳(coin$note)10Kbnd per☝\nYA ALLAH Tembaga,☝☝✅🤙✅✅\nOld coin\nOld notes\nStamps \nDuit lama\nCincin\nStoke\nAtique\nRing..", "SMALL!", "👏", "❤️", "“Offer to help share” - “offer”, “help” and “share” all imply that women should be the owner of the chores. How about normalising that men and women should both be responsible by simply saying “do the household chores”?", "👏👏", "❤️", "WAH SEH SAMMY!!!! 😍😍😍", "Amazing work Sam!!!", "IDOLLLL", "👏👏", "❤️❤️", "👏", "Merry Christmas 🎄 🎅 to you too 👏", "🙌🙌", "😍", "I don’t know how to say I’m grateful to @melisaoption the change she brought me and my family $15,900 in 7days with $3000. It’s enough to appreciate you.", "👏👏", "👏👏", "😍🙌", "👏😮", "And take care yrself, be strong 💪", "God bless all people in the world 🌎 🙏", "❤️❤️", "@yulia_affandi @oyzdenson", "👏👏", "Happy to know", "Thank you @msfcares for your big heart and opportunity for our youth Casey Ng!!! Love love love the stamp!!", "😂😂", "I am cancer patient.  Have stopped working for 2yrs. But now I have recover under medication 💊. I fee like going to work at hospital again? At medical report office.  And I can't decided? A bit like dont know how.", "இனிய தீபாவளி நல்வாழ்த்துக்கள்", "🔥👏", "❤️❤️", "Ladies and gentlemen, our neighbourhood hero, right here🙏🏻👏🏻👏🏻👏🏻", "So heartening to see the kampung spirit alive even in these tough times ☺❤", "😍😍😍", "❤️", "❤️❤️", "👏", "I am overwhelmed with joy right now, I can now pay my bills and take good care of my family, thank you for bringing happiness to my home and with just an investment of S$7,000 I got back S$75,000  my profits in 6 days I am much excited @romangrigory17_", "❤️", "👏👏👏", "Thank you @msfcares @imablecollective for this opportunity for our youths and families of @singaporefashionrunway to design and sew the Celebrating SG Women Collection for the nation! It means a lot to all of us and is our honour too. Do hope more people can suppprt this initiative at www.singaporefashionrunway.com", "Thank you @msfcares for your lovely sharing about our collaboration to commemorate the Year of Celebrating SG Women. We are proud to be a part of this meaningful project and thankful to have this opportunity to showcase the many talents of our makers.", "If I volunteer also will end up famous?", "Hi princesskool, if you are thinking of volunteering to help those in need, you may sign up here: https://go.gov.sg/volunteerwithmsf", "I also have some family issues can I take part in this? Believe wif my current situation I'll b able to understand more or better", "Amazing feat 👏", "Amazing feat 👏", "🙌❤️", "👏👏👏", "Wow! Well done Jasper!", "Inspiring story by Jasper 😊", "Trrrr", "❤️", "Happy #IWD2021 ❤️🙌", "❤️", "👍🏻👍🏻👍🏻", "♥️♥️♥️", "This is so excellent!", "❤️🙏", "omg #msfcares💜", "yup but reporting won't make a difference either, it has been proven multiple times that it only makes the situation worse 😔", "Hi what about help for verbal abuse", "@barelybellybelleart 😊", "#QOTD #wellnesswednesday #mentalhealth #mentalhealthquotes #mentalhealthmatters #mentalhealthawareness", "#QOTD #mentalhealth #mentalhealthquotes #mentalhealthmatters #mentalhealthawareness", "#QOTD #mentalhealth #mentalhealthquotes #mentalhealthmatters #mentalhealthawareness", "#QOTD #mentalhealth #mentalhealthquotes #mentalhealthmatters #mentalhealthawareness", "I can't explain how I feel each time i receive my payouts from your platform,all I can say is that you're God sent to my life @rebecca___grant", "Why did Jenna Lim sleep with you when she has a daughter ? Why she is such a slut ? Why did she call me a prostitute ?", "😘😘😘", "Every family deserves this time together 💯👍", "@phianomenal tho is you 😆", "👍👍", "👍👏👏👏😀🙏", "👍👍👍", "@_jia.wen_ i-", "Hurrah for the designated caregiver and those with space in their hearts and homes for young people like Kelly ❤️", "🤗", "u r my inspiration @abelpkr", "Wow I’m so inspired @abelpkr", "Proud of them. And thank you @msfcares for the shoutout :)🥰", "👍👍👏👏😀🙏", "😘💕😉💪🏻🇸🇬❤️", "😍", "👍👏👏😀🙏", "👍", "😍❤️", "🙌🏻🐣", "Thank you for your act of kindness♥️", "wah @xueyicrystal 🙌🏻", "Awesome xue yi @xueyicrystal 👏", "😍 AMAZING", "@glumster, @plumifiedz", "@xueyicrystal : 👏👏", "👍", "Great tips to manage anxiety and loneliness during this period", "#mentalhealth #mentalwellbeing", "👍❤️❤️❤️", "@cupofsunflower_", "Well done Serene!", "❤️", "👍❤️❤️❤️", "Thank you for the lovely shout-out 🙏😊 #supportInclusion #celebrateabilities", "@candylious_ our favs", "You can find us on Android and IOS App Store :) ❤️😍", "Please beware of cross contamination between patroniser and food.vendor", "#msfgreeniesrock", "Thank you! 😊😊🙏🏻🙏🏻", "Thefting Grandmother", "Some ppl will be like um ok? Takes cake put it aside and starts doing it again", "Great video!! 👏🏻"]