["👏👏", "@cherylongkx @cool_zillavince", "Congratulations on 70 years! 💪✨", "Thank you for the memories. It was an honour to have worked as a teacher there. @nsd_be", "Hi @sgchildrensoc pls check dm thank you", "Promote it on @Mentalhealth_.community", "Hope you guys enjoyed the game! #RiseandRoar #ONESTRONG", "only took part in a few activities conducted by scs, but they were really fun :)", "One of the children in CC1. There since 3yrs old to 12 yrs old.", "Can send the recording link to rewatch this event again", "Good 👏👏", "What a great initiative 👏👏👏", "வாழ்த்துக்கள்👏", "中秋节快乐！", "can live stream this talk on your facebook. then i will not rsvp", "👏👏👏", "Nice 👏👏", "Hi. Hope you are less sad today. You can reach Tinkle Friend at helpline (1800-2744-788) or online chat, www.tinklefriend.sg to chat on this", "I feel very sad today because I wanted to wear a ear ring for my first time but my parents don't allow me what can I do to make my parents allow 😔😢", "Hey tinker friend😢", "@rynnnasir", "Happy father's day 🌷", "Wow. Please bring on more of this. Will you??", "@rynnnasir", "Hit your head on the wall. Don’t hit your children", "Happy vesak day! 🌟", "🔥🔥😍😍", "Promote This on\n@nft_art_galaxy", "Beautifully done team!!", "👏👏👏 Is a good song with a strong message . Congratulations to the team:)", "😍😍", "😍", "amazing. ~darrenyoe", "🙌🔥", "🤩🤩💗", "This is fire! 😍", "👏👏", "👏👏👏👏", "Powerful message ❤️", "👏👏👏👏👏👏", "Alamak @snorlax_is_mehh 🔥", "😍😍😍", "You guys rock!", "👏😍", "Nicely done ❤️", "😍😍😍😍", "Beautiful lyrics & song! 👏", "😍🙌 It’s a beautiful song and so needed. Thank you!", "😍😍😍😍😍", "👍🏻💪🏼🎤", "🧡💛💚💙💜", "😍😍😍😍😍❤️❤️\n\nTruly proud of this ground up initiative by the youth! #mentalheathawareness #positiveyouthdevelopment #assetbuilding #jurongyouthcentre", "😍😍😍", "😍😍😍", "Show us your support by sharing this video or commenting with this emoticon 😍 to cheer our youth members on for this wonderful initiative!", "📣 In light of the tightened measures to curb the spread of COVID-19, all eight sessions of our Storm Riders programme will be delivered via Zoom instead.", "omg Mr Taha !! niiccee", "Nice tree!", "Good luck today with your fundraiser❤️🙌", "😍😍😍", "Very creative! Way to go to making Physics cool!", "💓", "This is great 👏", "#kindness", "Merry Christmas ❤️", "#bodysafety #bodysafetyskills #childsexualabuseprevention #kidzlive #sgchildrensociety", "Hi, can i share this? It's so informative!", "Great messages. Thank you.  Holly", "So cute", "👏🏻", "This is so amazing.", "Amazing!", "@jaydentey2019 @julian.tey ❤️", "👏🏻", "@luisabao_ @awesmazing @candourme @happyrabbit.kc @hazeeelin woman power! Please support! ❤️", "ray is v cute !!", "@thedivaeatsprata", "💪🏻", "👏🏻👏🏻👏🏻Great 👍🏻👍🏻👍🏻", "This looks like an session.", "I like this - getting youth to talk about strengths.", "@wxn.si aiyo 🔥🔥😍", "@wxn.si 😍😍😍", "#StoneDovesForever", "Happy Father’s Day! ❤️", "@rinnayeo @_lyx._.joyce got @solomon.sensei sia", "Such lovely and positive thoughts! 👏", "My bro 💯💯💯", "Thank you for continuing to work with the children and youths in these tough times 💪🏽", "Yes we can!!!#stayhealthy #staysafe", "Some familiar faces! 👏👏", "My hope that after covid19, we can see everything is back to where it first started off, a normal and happy life (:", "I hope that we will all stay united and strong to tide through the storm together! It won’t be easy alone but with the support of your family, friends & the extended community, we can definitely overcome this global pandemic! ❤️💪🏼", "😁new vision awake", "I hope that people continue the spirit of caring and sharing after the circuit breaker ends 🌞", "These are tough times and we really learn to appreciate the small things like spending time with our family. Hope that everyone will continue to be kind and understanding of each other, and we become stronger as individuals and as a nation! 💪💪💪", "Appreciative society who treasure the little things and not take what seems normal/ the new normal for granted 🌈", "I hope that our children can grow happily and healthily after COVID-19 and that we will emerge out of this as a stronger country!", "Hope that everything will return to normal soon!", "I hope to be able to hug my loved ones and friends soon!! I hope for a more tolerant and loving society!! @liyen77 @liseliew @immamommy.grace @luisabao_ @awesmazing", "I hope that after covid19, people will be more appreciative of the normal lifestyle we have. Being able to interact with people and commute to and fro schools, work and places ❤️", "I hope for a kinder Singapore with increased empathy and civic mindedness amongst us. We can do it! 💕💕💕", "I hope that we’ll all continue to do our part in keeping the living/working environment safe for everyone! May social distancing end soon ❤ Can’t wait to see my grandparents 👵🏼 👨🏼‍🦳🙆🏻‍♀️🙌", "🎈", "I hope for a healthier Singapore with lower cases of COVID-19.", "Happy retirement Mr. Tan! I vividly remember meeting Mr. Tan when I was doing my polytechnic internship in 2003, he's a warm and kind person! Singapore Childrens Society was back then at Jalan Kalapa.", "On behalf of ISPCAN we wish Mr Alfred Tan a retirement full of joy. Thank you for all you have done.", "My children got kidnaped for abductions for sex trafficking or sex exploration , that’s why I am ver pathetic as the terrorists from terrorism challenges me with bestiality !", "👏", "they looked so happy receiving the laptop!", "#sgchildrensociety #tinklefriend", "#sgchildrensociety #straitstimes", "#SGUnited #letsfightthevirus #sgchildrensociety #mediacorp #mediacorpch8", "@sheenhl talking to mom about @wolfgangviolin doing something for this 🌈", "Thumb up", "@immamommy.grace", "Good job", "👏", "🔥🔥🔥🔥🔥", "Thanks for the great work @sgchildrensoc and for bring the light of hope for many", "@jonathan.ng.kw", "Happy new year everyone!", "Merry Christmas to everyone at Children's Society - AA.", "Very inspiring!", "👏👏👏", "Yeah thats me and yeah i did thems makeup uwu", "Awww 😢😢😢😢 So Sad", "❤️ ❤️ ❤️", "😱$2.63 3 meals", "@quahpl", "@mrjohnlim", "💚", "@nekowonie", "@ooi14_9 lets try HAHAH", "I won’t eat breakfast Nor lunch but dinner I will eat $2 combo 711 noodles and drinks", "😢 #childreninneed", "👏👏👏", "Link is not clickable", "Well said! 🙌", "@immamommy.grace #cyberbullying", "👏👏", "Happy Birthday Singapore!!! 🇸🇬 🇸🇬 🇸🇬 #MajulahSingapura !!! #NDP2019 #NationalDay #NDP", "Happy birthday Singapore", "❤", "Thank You For Helping them", "👏👏", "Singapore Children’s Society was established in 1952.\n@sulina62 @arif1995er \nMy FB name is 隆君余", "Awesome", "Oh tHATS US HIIII 😍", "Hi. Do these kids need help with reading or any skills? I would like to volunteer to help them.", "😍", "😃", "👍👋", "Glad to know that I am friends with many superheroes! ❤️❤️❤️", "So cool! Awesome!", "🙂", "Great info", "#CSCturns10", "👍", "Lovely Instagram account ✨ Do check us (Cradle Of Love) out! 😊", "Thank you. This is super useful. These tips are great reminders, particularly when parents are busy with their work, schedules, deadlines and forget how to behave around their little ones.", "OMG MY BANGS😂😂😂😂", "Thats meh", "Great!", "Dats me heyyyy", "nice 👌🏼", "@officialvjanani thank you !", "#goodstuff", "👋🙋‍♀️Have you ever visited our store?", "@photocopyme", "👍", "Informative and useful! Thank you.", "👍👍", "❤️", "Hi there! We love that you're all about charity! Stick to the excellent work.", "How to donate", "Good one :)", "Let’s make this Christmas a merry Christmas for kids on streets #betheirsanta 🎅♥️", "Ola", "Merry Christmas", "Hi @sgchildrensoc, thanks for the info! I'll keep a lookout for it. ☺", "Hi @missymelt, we are sorry that you've missed it. Please look out for the coverage in the December 2017 issue of our Sunbeam newsletter on our website www.childrensociety.org.sg/news-report", "Hi Children Society! Was an hr late for Minister Chan's Lecture. Missed out the important part. Will you be sharing the video coverage or post the writeup coverage?", "Really Nice :)", "Made my day", "@kextay @pornsakp @broadwaybeng", "👍", "Awesome!", "Nice... Check us out!", "@sgchildrensoc Hw abt e price of a piece?", "See you soon 😊", "😊", "See you soon 😊", "😊", "See you soon 😊", "See you soon 😊", "👍", "Nice!", "Nice!", "😊", "👍", "😊", "Nice!", "😊", "😊", "@ssmellz", "#beautiful drawing😘", "Wonderful", "It's really hot! Keep hydrated all!", "Thank you. Have replied you😊", "@wealsocare thank you for the comment. i have left a private message for you on instagram. please take a look. cheers!", "Hi I'm Jane Koe from Temasek Sec Parent Support Group. Would be interested to engage your facilitators to conduct a sharing session for our parents.", "Very nice! 😃", "Terrific!", "Temasek Sec PSG wishes the staff of S'pore Children's Society a very Happy and Prosperous New Year:)", "Glad everyone enjoyed their lunch at seoul garden 😊😊😊", "Well done !", "@sgchildrensoc Hello, no worries. Thank you for the reply :)", "@projectfivefingers Hi, sorry if you missed our sale, but we haven't got any upcoming ones planned yet.", "Will the sale be happening again?", "@wealsocare We welcome all youth aged 13 to 18.", "Is this open to all youth?", "Will certainly support the volunteers in your Flag Day tomorrow. All the best to a successful Flag Day tomorrow and good luck !", "Thank you.", "Dear @wealsocare, thank you for writing to Singapore Children's Society. You may certainly publicise our competition. Do note that the submission deadline has been extended to 30 November 2015. You may submit your entries via e-mail to tinklefriend@childrensociety.org.sg or write to us at the address mentioned. We look forward to viewing your submissions!", "Hi I am interested to publicise the competition to parents of a primary school where I am a parent volunteer. Please advise. Thank you.", "hope the haze gets worse and school closes", "@whyjacknotson I think this can help u", "Thumbs up little heroes!!! 👍👍👍", "Precious children", "👍", "This is cool", "wonderful photo. Thanks for posting", "@vox.44cc We're looking forward to it too! Have a blast!", "Thanks for the shout out! We are gonna rock the deck this Friday!", "@hayleystarrkids We're happy to bring joy to our children too :)", "☺"]